znowflak3/NRF52DK_ST7789/main.c
    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
	
	// STEP 6: Declare and instantiate the scan response
	init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
/*
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}
*/

/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETED_SUCEEDED event
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);

        APP_ERROR_CHECK(err_code);
    }
}
/*
void spim_event_handler(nrfx_spim_evt_t const * p_event,
                       void *                  p_context)
{
    spi_xfer_done = true;
    NRF_LOG_INFO("Transfer completed.");
    if (m_rx_buf[0] != 0)
    {
        NRF_LOG_INFO(" Received:");
        NRF_LOG_HEXDUMP_INFO(m_rx_buf, strlen((const char *)m_rx_buf));
    }
}
*/

static void spim_init(void)
{
    //xfer_desc = NRFX_SPIM_XFER_TRX(m_tx_buf, m_length, m_rx_buf, m_length);
/*
    nrf_gpio_pin_set(NRFX_SPIM_SCK_PIN);
    nrf_gpio_cfg_output(NRFX_SPIM_SCK_PIN);
    nrf_gpio_pin_clear(NRFX_SPIM_MOSI_PIN);
    nrf_gpio_cfg_output(NRFX_SPIM_MOSI_PIN);
    nrf_gpio_cfg_input(NRFX_SPIM_MISO_PIN, NRF_GPIO_PIN_NOPULL);
*/

    nrf_gpio_cfg_output(NRFX_SPIM_DCX_PIN);
    nrf_gpio_cfg_output(NRFX_SPIM_RESET_PIN);


    spi_config.frequency      = NRF_SPIM_FREQ_8M;
    spi_config.mode           = NRF_SPIM_MODE_3;
    spi_config.bit_order      = NRF_SPIM_BIT_ORDER_MSB_FIRST;
    spi_config.ss_pin         = NRFX_SPIM_SS_PIN;
    spi_config.miso_pin       = NRFX_SPIM_MISO_PIN;
    spi_config.mosi_pin       = NRFX_SPIM_MOSI_PIN;
    spi_config.sck_pin        = NRFX_SPIM_SCK_PIN;
    spi_config.ss_active_high = false;

    ret_code_t err_code = nrfx_spim_init(&lcdSpi, &spi_config, NULL, NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_INFO("NRFX SPIM example started.");
}
/*
static inline void spim_write(const void * data, size_t size)
{
    ret_code_t err_code =nrfx_spim_xfer(&spi, data, size, NULL);

    APP_ERROR_CHECK(err_code);
}
static void write_command(uint8_t c)
{
    nrf_gpio_pin_clear(NRFX_SPIM_DCX_PIN);
    spi_write(&c, sizeof(c));
}

static void write_data(uint8_t c)
{
    nrf_gpio_pin_set(NRFX_SPIM_DCX_PIN);
    spi_write(&c, sizeof(c));
}
*/
/**@brief Function for application main entry.
 */
void setCommandPin()
{
    nrf_gpio_pin_clear(NRFX_SPIM_DCX_PIN);
}

void setDataPin()
{
    nrf_gpio_pin_set(NRFX_SPIM_DCX_PIN);
}

int main(void)
{
    bool erase_bonds;

    // Initialize.
    log_init();
	timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
    peer_manager_init();
   

    // Start execution.
    NRF_LOG_INFO("started.");
    application_timers_start();

    advertising_start(erase_bonds);

    spim_init();
    // Enter main loop.

    
    const int16_t screenSizeX = 240;
    const int16_t screenSizeY = 240;

    
    //int16_t windowPositionX = 0;
    //int16_t windowPositionY = 0;
    //int16_t windowSizeX = 240;
    //int16_t windowSizeY = 240;
    
    //nrf_gpio_cfg_output(NRFX_SPIM_SS_PIN);
    //nrf_gpio_pin_clear(NRFX_SPIM_SS_PIN);


    // Hardware-reset the Screen controller
    nrf_gpio_pin_clear(NRFX_SPIM_RESET_PIN);
    nrf_delay_ms(15);

    nrf_gpio_pin_set(NRFX_SPIM_RESET_PIN);
    nrf_delay_ms(2);

    // Prepare the commands to software-reset the controller
    static uint8_t lcdTxSwreset = ST7789_CMD_SWRESET;
    static uint8_t lcdTxSlpout  = ST7789_CMD_SLPOUT;
    nrfx_spim_xfer_desc_t lcdXferSwreset = NRFX_SPIM_XFER_TX(&lcdTxSwreset, 1);
    nrfx_spim_xfer_desc_t lcdXferSlpout  = NRFX_SPIM_XFER_TX(&lcdTxSlpout, 1);

    static uint8_t lcdTxColmodCmd  = ST7789_CMD_COLMOD;
    static uint8_t lcdTxColmodData = 0x55;
    nrfx_spim_xfer_desc_t lcdXferColmodCmd  = NRFX_SPIM_XFER_TX(&lcdTxColmodCmd, 1);
    nrfx_spim_xfer_desc_t lcdXferColmodData = NRFX_SPIM_XFER_TX(&lcdTxColmodData, 1);

    static uint8_t lcdTxMadctlCmd  = ST7789_CMD_MADCTL;
    static uint8_t lcdTxMadctlData = 0;
    nrfx_spim_xfer_desc_t lcdXferMadctlCmd  = NRFX_SPIM_XFER_TX(&lcdTxMadctlCmd, 1);
    nrfx_spim_xfer_desc_t lcdXferMadctlData = NRFX_SPIM_XFER_TX(&lcdTxMadctlData, 1);

    static uint8_t lcdTxCasetCmd = ST7789_CMD_CASET;
    static uint8_t lcdTxCasetData[] = {
            0,
            0,
            (uint8_t)(screenSizeX >> 8),
            (uint8_t)(screenSizeX & 0xFF)
    };
    nrfx_spim_xfer_desc_t lcdXferCasetCmd = NRFX_SPIM_XFER_TX(&lcdTxCasetCmd, 1);
    nrfx_spim_xfer_desc_t lcdXferCasetData = NRFX_SPIM_XFER_TX(lcdTxCasetData, sizeof(lcdTxCasetData));

